why-scala-implicits.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-19 Tue 17:26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Why Scala Implicits</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Gnanesh Kunal">
<meta name="description" content="Short note on why Implicits in Scala."
>
<meta name="keywords" content="Programming Languages, Scala">
<link rel="stylesheet" href="css/stylesheet.css">
</head>
<body>
<div id="content">
<header>
<h1 class="title">Why Scala Implicits</h1>
</header><p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;Jun 20, 2018&gt;</span></span>
</p>

<p>
There's a huge debate on Scala Implicits since they've introduced it to
the language. Some people love it while some people comment it on making
the code unpredictable. So should we use it?
</p>

<p>
Before I tell you what <code>implicits</code> actually are, I'll tell you what they
solve.
</p>

<p>
If you have to store the details of a Person's name and age, there are
two ways to do it.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Person</span>(name<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">String</span>, age<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Int</span>)
</pre>
</div>

<p>
While this does the work we need, it's not the right way to do it. This
simple declaration lacks a lot of features.
</p>

<p>
To get most of all the features(mainly pattern matching) we have to
declare a <code>case class</code>. So, Now the above code will be turned to:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #0000FF;">case</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Person</span>(name<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">String</span>, age<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Int</span>)
</pre>
</div>

<p>
Usage:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #D0372D;">Person</span>(<span style="color: #008000;">"Gnanesh Kunal"</span>, <span style="color: #D0372D;">20</span>)
</pre>
</div>

<p>
The name here is just a simple string.
</p>

<p>
It doesn't say anything about the person's <code>firstname</code> and <code>lastname</code>.
We simply have to split the given string and must think the first item
in the array corresponds to his first name. But that's still not the
right way to do it. But for now, let me keep it simple and limit name to
just a string.
</p>

<p>
<i>It would be better if we have a separate datatype that defines
something.</i> So, let's define some.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #0000FF;">case</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Name</span>(name<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">String</span>) 
<span style="color: #0000FF;">case</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Age</span>(age<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Int</span>)
</pre>
</div>

<p>
So now, let me use those datatypes.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">name</span> <span style="color: #0000FF;">=</span> <span style="color: #D0372D;">Name</span>(<span style="color: #008000;">"Gnanesh Kunal"</span>)
<span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">age</span> <span style="color: #0000FF;">=</span> <span style="color: #D0372D;">Age</span>(<span style="color: #D0372D;">20</span>)
<span style="color: #0000FF;">val</span> <span style="color: #BA36A5;">person</span> <span style="color: #0000FF;">=</span> <span style="color: #D0372D;">Person</span>(name, age)
</pre>
</div>

<p>
If you try running the above code, you would get a type mismatch error.
</p>

<div class="org-src-container">
<pre class="src src-sh">scala&gt; val person = Person(name, age)
&lt;console&gt;:33: error: type mismatch;
 found   : Name
 required: String
       val person = Person(name, age)
                           ^
&lt;console&gt;:33: error: type mismatch;
 found   : Age
 required: Int
       val person = Person(name, age)
                                 ^
</pre>
</div>

<p>
What we have known here is that the <code>name</code> and <code>age</code> variable have
<code>Name</code> and <code>Age</code> datatypes respectively. But what we need is a <code>String</code>
and <code>Int</code>. As I've told you earlier that using custom datatypes leads us
to define many different data structures.
</p>

<p>
The Person class must be re-implemented using the newer data types.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #0000FF;">case</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Person</span>(name<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Name</span>, age<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Age</span>)
</pre>
</div>

<p>
This works now.
</p>

<div class="org-src-container">
<pre class="src src-sh">scala&gt; Person(name, age)
res1: Person = Person(Name(Gnanesh Kunal),Age(20))
</pre>
</div>

<p>
But do you think the following code is gonna work?
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #D0372D;">Person</span>(<span style="color: #008000;">"Gnanesh Kunal"</span>, <span style="color: #D0372D;">20</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">scala&gt; Person(<span style="color: #008000;">"Gnanesh Kunal"</span>, 20)
&lt;console&gt;:30: error: type mismatch;
 found   : String(<span style="color: #008000;">"Gnanesh Kunal"</span>)
 required: Name
       Person(<span style="color: #008000;">"Gnanesh Kunal"</span>, 20)
              ^
&lt;console&gt;:30: error: type mismatch;
 found   : Int(20)
 required: Age
       Person(<span style="color: #008000;">"Gnanesh Kunal"</span>, 20)
</pre>
</div>

<p>
The same error again. The object must be initialized like:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #D0372D;">Person</span>(<span style="color: #D0372D;">Name</span>(<span style="color: #008000;">"Gnanesh Kunal"</span>), <span style="color: #D0372D;">Age</span>(<span style="color: #D0372D;">20</span>))
</pre>
</div>

<p>
Another implementation would be to try multiple constructors.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #0000FF;">case</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Person</span>(n<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">String</span>, a<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Int</span>) {
    <span style="color: #0000FF;">var</span> <span style="color: #ff0000; font-weight: bold;">name</span><span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Name</span> <span style="color: #0000FF;">=</span> <span style="color: #D0372D;">Name</span>(n)
    <span style="color: #0000FF;">var</span> <span style="color: #ff0000; font-weight: bold;">age</span><span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Age</span> <span style="color: #0000FF;">=</span> <span style="color: #D0372D;">Age</span>(a)
    <span style="color: #0000FF;">def</span> <span style="color: #0000FF;">this</span>(n<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Name</span>, a<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Age</span>) <span style="color: #0000FF;">=</span> <span style="color: #0000FF;">this</span>(n.name, a.age)
}   
</pre>
</div>

<p>
The parameters names have been changed to <code>n</code> and <code>a</code> since each
parameter defined will become a property in Scala.
</p>

<p>
Now let us try to create the objects.
</p>

<div class="org-src-container">
<pre class="src src-sh">scala&gt; Person(<span style="color: #008000;">"Gnanesh Kunal"</span>, 20) <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Yay!!</span>
res10: Person = Person(Gnanesh Kunal,20)

scala&gt; Person(Name(<span style="color: #008000;">"Gnanesh Kunal"</span>), Age(20)) <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Boo!!</span>
&lt;console&gt;:30: error: type mismatch;
 found   : Name
 required: String
       Person(Name(<span style="color: #008000;">"Gnanesh Kunal"</span>), Age(20))
                  ^
&lt;console&gt;:30: error: type mismatch;
 found   : Age
 required: Int
       Person(Name(<span style="color: #008000;">"Gnanesh Kunal"</span>), Age(20))
                                        ^
</pre>
</div>

<p>
<i>Why does it still not work?</i>
</p>

<p>
Well!! The <code>this(n: Name, a: Age)</code> is an auxiliary constructor. The
<code>apply</code> methods which will be generated for <code>case class</code> objects won't
be defined for them. To define a class with <code>Name</code> and <code>Age</code> as
parameters types, we must use the <code>new</code> keyword.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Person</span>(<span style="color: #D0372D;">Name</span>(<span style="color: #008000;">"Gnanesh Kunal"</span>), <span style="color: #D0372D;">Age</span>(<span style="color: #D0372D;">20</span>))
</pre>
</div>

<p>
To do something like <code>Person(Name("Gnanesh Kunal"), Age(20))</code> to work we
must create a companion object.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Person class Implementation ...</span>

<span style="color: #0000FF;">object</span> <span style="color: #D0372D;">Person</span> {
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">apply</span>(n<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Name</span>, a<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Int</span>) <span style="color: #0000FF;">=</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Person</span>(n.name, a.age) 
}
</pre>
</div>

<p>
Finally it works.
</p>

<div class="org-src-container">
<pre class="src src-sh">scala&gt; Person(<span style="color: #008000;">"Gnanesh Kunal"</span>, 20)
res14: Person = Person(Gnanesh Kunal,20)

scala&gt; Person(Name(<span style="color: #008000;">"Gnanesh Kunal"</span>), Age(20))
res15: Person = Person(Gnanesh Kunal,20)
</pre>
</div>

<p>
The complete above code to make the person class work.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #0000FF;">case</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Name</span>(name<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">String</span>) 
<span style="color: #0000FF;">case</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Age</span>(age<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Int</span>)

<span style="color: #0000FF;">case</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Person</span>(n<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">String</span>, a<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Int</span>) {
    <span style="color: #0000FF;">var</span> <span style="color: #ff0000; font-weight: bold;">name</span><span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Name</span> <span style="color: #0000FF;">=</span> <span style="color: #D0372D;">Name</span>(n)
    <span style="color: #0000FF;">var</span> <span style="color: #ff0000; font-weight: bold;">age</span><span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Age</span> <span style="color: #0000FF;">=</span> <span style="color: #D0372D;">Age</span>(a)
    <span style="color: #0000FF;">def</span> <span style="color: #0000FF;">this</span>(n<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Name</span>, a<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Age</span>) <span style="color: #0000FF;">=</span> <span style="color: #0000FF;">this</span>(n.name, a.age)
}

<span style="color: #0000FF;">object</span> <span style="color: #D0372D;">Person</span> {
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">apply</span>(n<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Name</span>, a<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Int</span>) <span style="color: #0000FF;">=</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Person</span>(n.name, a.age) 
}
</pre>
</div>

<p>
So much hassle to define a simple class, right?
</p>

<p>
<b><i>Implicits to the rescue.</i></b>
</p>

<p>
Implicits can be said as a syntactic sugar.
</p>

<p>
Doing everything defined above under a minute.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #0000FF;">case</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Name</span>(name<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">String</span>) 
<span style="color: #0000FF;">case</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Age</span>(age<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Int</span>)

<span style="color: #0000FF;">case</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Person</span>(name<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Name</span>, age<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Age</span>)

<span style="color: #006FE0;">implicit</span> <span style="color: #0000FF;">def</span> <span style="color: #006699;">strToName</span>(name<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">String</span>)<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Name</span> <span style="color: #0000FF;">=</span> <span style="color: #D0372D;">Name</span>(name)
<span style="color: #006FE0;">implicit</span> <span style="color: #0000FF;">def</span> <span style="color: #006699;">intToAge</span>(age<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Int</span>)<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Age</span> <span style="color: #0000FF;">=</span> <span style="color: #D0372D;">Age</span>(age)
</pre>
</div>

<p>
Everything fits.
</p>

<div class="org-src-container">
<pre class="src src-scala">scala&gt; <span style="color: #D0372D;">Person</span>(<span style="color: #D0372D;">Name</span>(<span style="color: #008000;">"Gnanesh Kunal"</span>), <span style="color: #D0372D;">Age</span>(<span style="color: #D0372D;">20</span>))
res17<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Person</span> <span style="color: #0000FF;">=</span> <span style="color: #D0372D;">Person</span>(<span style="color: #D0372D;">Name</span>(<span style="color: #D0372D;">Gnanesh</span> <span style="color: #D0372D;">Kunal</span>),<span style="color: #D0372D;">Age</span>(<span style="color: #D0372D;">20</span>))

scala&gt; <span style="color: #D0372D;">Person</span>(<span style="color: #008000;">"Gnanesh Kunal"</span>, <span style="color: #D0372D;">20</span>)
res18<span style="color: #0000FF;">:</span> <span style="color: #6434A3;">Person</span> <span style="color: #0000FF;">=</span> <span style="color: #D0372D;">Person</span>(<span style="color: #D0372D;">Name</span>(<span style="color: #D0372D;">Gnanesh</span> <span style="color: #D0372D;">Kunal</span>),<span style="color: #D0372D;">Age</span>(<span style="color: #D0372D;">20</span>))
</pre>
</div>

<p>
The way <code>Person("Gnanesh Kunal", 20)</code> works are, first, the compiler
will check the parameter types. The compiler expects the first parameter
of type <code>Name</code> but finds the type <code>String</code> it'll be ready to throw an
error. Before throwing an error, the compiler checks for some function
which converts the object of type <code>String</code> to <code>Name</code>. Something like
<code>s: String =&gt; Name</code>.
</p>

<p>
So as we have defined a function which converts a <code>String</code> datatype to
<code>Name</code> it calls the function for us automatically. To make the compiler
to call the function we have to prefix the keyword <code>implicit</code>. Implicit
functions can't we called explicitly.
</p>

<p>
<i>cool</i> <code>☜(⌒▽⌒)☞</code>
</p>

<p>
<code>implicit=s aren't just limited to functions, there's =implicit</code>
variables, classes, objects etc.
</p>
</div>
</body>
</html>
